## Encoding Begins From Here

In [28]:
# Importing the liibraries

import pandas as pd


sfile = pd.read_csv("Salary_Data.csv")
sfile.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [29]:
# Checking the null values

sfile.isnull().sum()

Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
dtype: int64

In [30]:
# Removing the null values

sfilena = sfile.dropna()

In [31]:
sfilena.isnull().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [32]:
# Checking the columns values

sfilena.columns

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience',
       'Salary'],
      dtype='object')

In [33]:
# Replacing the written letter of education level and years of experience

sfilere = sfilena.rename(columns = {
    "Education Level":"Education",
    "Years of Experience":"Experience"
})

In [34]:
sfilere.head()

    Age  Gender   Education          Job Title  Experience    Salary
0  32.0    Male  Bachelor's  Software Engineer         5.0   90000.0
1  28.0  Female    Master's       Data Analyst         3.0   65000.0
2  45.0    Male         PhD     Senior Manager        15.0  150000.0
3  36.0  Female  Bachelor's    Sales Associate         7.0   60000.0
4  52.0    Male    Master's           Director        20.0  200000.0

In [35]:
# Mainting the consistency where there is no consistent variables

sfilere['Education']


sfilere['Education'].unique()

array(["Bachelor's", "Master's", 'PhD', "Bachelor's Degree",
       "Master's Degree", 'High School', 'phD'], dtype=object)

In [36]:
# Renaming

sfilere['Education'] = sfilere['Education'].replace({
    "Bachelor's Degree": "Bachelors",
    "Master's Degree": "Masters",
    "Bachelor's": "Bachelors",
    "Master's": "Masters",
    "phD": "PhD"
})

In [37]:
sfilere['Education'].unique()

array(['Bachelors', 'Masters', 'PhD', 'High School'], dtype=object)

In [38]:
# Ordinal Values are now mapped or replaced as

sfilere['Education'] = sfilere['Education'].map({
    'High School': 0,
    'Bachelors': 1,
    'Masters': 2,
    'PhD': 4
})

In [39]:
sfilere.head()

    Age  Gender  Education          Job Title  Experience    Salary
0  32.0    Male          1  Software Engineer         5.0   90000.0
1  28.0  Female          2       Data Analyst         3.0   65000.0
2  45.0    Male          4     Senior Manager        15.0  150000.0
3  36.0  Female          1    Sales Associate         7.0   60000.0
4  52.0    Male          2           Director        20.0  200000.0

In [40]:
# NOw we move on to Gender Values since it has nominal values

# We use pd.get_dummies function to have this  thing working

import pandas as pd

sfilere['Gender'].unique()

array(['Male', 'Female', 'Other'], dtype=object)

In [42]:
df = pd.get_dummies(sfilere['Gender'], dtype=int)
df.head()

   Female  Male  Other
0       0     1      0
1       1     0      0
2       0     1      0
3       1     0      0
4       0     1      0

In [43]:
# Converting the data into numpy arrays

import numpy as np

dfnp = np.array([[40,0,0]])

dfnp = np.array([[40,1,0]])

In [ ]:
# SPlitting the features